package teamnova_0412;

public class 날씨 {
	//날씨 스레드
	//20초에 한번씩 출력
	private int 날씨;
	
	public int 날씨메소드(int 캐릭터공격력) {
		날씨= (int)(Math.random()*10);
		if(날씨>4) {//56789
			System.out.println("================날씨알림================\n\n"
					+ "                        "
					+ "날씨가 화창합니다.\n"
					+ "                     "
					+ "공격력이 5상승합니다.\n\n"
					+ "======================================\n");
			캐릭터공격력= 캐릭터공격력+5;
		}else if(날씨>=2&&날씨<=4) { //234
			System.out.println("================날씨알림================\n\n"
					+ "                        "
					+ "날씨가 흐립니다.\n"
					+ "                     "
					+ "공격력이 3하락합니다.\n\n"
					+"======================================\n");
			캐릭터공격력= 캐릭터공격력-3;
		}else if(날씨<2) {//01
			System.out.println( "================날씨알림================\n\n"
					+ "                      "
					+ "비가 엄청 많이 내립니다.\n"
					+ "                       "
					+ "공격력이 5하락합니다.\n\n"
					+ "======================================\n");
			캐릭터공격력= 캐릭터공격력-5;
		}
		return 캐릭터공격력;
	}
	

}
